# SolidOptions Class

---
A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.
SystemObject Autodesk.Revit.DBSolidOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class SolidOptions : IDisposable

    Public Class SolidOptions
    	Implements IDisposable

    public ref class SolidOptions : IDisposable

    type SolidOptions =
        class
            interface IDisposable
        end
The SolidOptions type exposes the following members.
| Name| Description
---|---|---
| SolidOptions|  Creates a new SolidOptions class with material and graphics style settings.
Top
| Name| Description
---|---|---
| ExtraFaceAndEdgeHistoryKey|  Optional extra key used to create face and edge histories for the Solid. If extraFaceAndEdgeHistoryKey is higher than -1, the Solid's face and edge histories will be created depending on the geometry generation of the Solid.
| GraphicsStyleId|  Defines the graphics style id for the Solid.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MaterialId|  Defines the material id for the Solid.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the SolidOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace